BAS BMEKZU Project/src/Documents/ИНАГРО_УстановкаПараметровВидовКультур/ИНАГРО_УстановкаПараметровВидовКультур.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_УстановкаПараметровВидовКультур</name>
  <registerRecords>InformationRegister.ИНАГРО_ЗначенияБазисов</registerRecords>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>ВидКультуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ИНАГРО_ВидыКультур</types>
      </type>
    </attributes>
    <attributes>
      <name>Влажность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВлажностьДляРасчетаУслуг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СорнаяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СорнаяПримесьДляРасчетаУслуг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗерноваяПримесь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/ИНАГРО_ЗначенияБазисов/ИНАГРО_ЗначенияБазисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИНАГРО_ЗначенияБазисов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Влажность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВлажностьДляРасчетаУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СорнаяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СорнаяПримесьДляРасчетаУслуг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗерноваяПримесь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидКультуры</name>
    <type>
      <types>CatalogRef.ИНАГРО_ВидыКультур</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Documents/ИНАГРО_УстановкаПараметровВидовКультур/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда  

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("Структура") И ДанныеЗаполнения.Свойство("АдресТаблицаБазисныеЗначенияВХранилище") Тогда
		ЗаполнениеДокументов.ЗаполнитьПоСтруктуре(ЭтотОбъект, ДанныеЗаполнения);
		ЗаполнитьТабличнуюЧасть(ДанныеЗаполнения);
	Иначе
		ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
		ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения); 	
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры 

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
		   
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	СтруктураШапкиДокумента = ОбщегоНазначенияРед12.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);

	// Заполним по шапке документа дерево параметров, нужных при проведении.
	ДеревоПолейЗапросаПоШапке = ОбщегоНазначенияРед12.СформироватьДеревоПолейЗапросаПоШапке();
	                                          
	// Сформируем запрос на дополнительные параметры, нужные при проведении, по данным шапки документа.
	СтруктураШапкиДокумента = УправлениеЗапасами.СформироватьЗапросПоДеревуПолей(ЭтотОбъект, ДеревоПолейЗапросаПоШапке, СтруктураШапкиДокумента, "");
		
	// Движения по документу
	Если НЕ Отказ Тогда
		
		Для Каждого СтрокаТабличнойЧасти Из Товары Цикл
			
			Движение = Движения.ИНАГРО_ЗначенияБазисов.Добавить();
			Движение.Период 			          = Дата;
			Движение.Организация 		          = Организация;
			Движение.Контрагент 		          = Контрагент;
			Движение.ДоговорКонтрагента           = ДоговорКонтрагента;
			Движение.Склад                        = Склад;
			Движение.ВидКультуры 		          = СтрокаТабличнойЧасти.ВидКультуры;
			Движение.Влажность			          = СтрокаТабличнойЧасти.Влажность;
			Движение.ВлажностьДляРасчетаУслуг 	  = СтрокаТабличнойЧасти.ВлажностьДляРасчетаУслуг;
			Движение.СорнаяПримесь				  = СтрокаТабличнойЧасти.СорнаяПримесь;
			Движение.СорнаяПримесьДляРасчетаУслуг = СтрокаТабличнойЧасти.СорнаяПримесьДляРасчетаУслуг;
			Движение.ЗерноваяПримесь 			  = СтрокаТабличнойЧасти.ЗерноваяПримесь;
						
		КонецЦикла;
	
	КонецЕсли;	
		
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект);

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункци

Процедура ЗаполнитьТабличнуюЧасть(Параметры)
	
	АдресТаблицаБазисныеЗначенияВХранилище = "";
	
	Параметры.Свойство("АдресТаблицаБазисныеЗначенияВХранилище", АдресТаблицаБазисныеЗначенияВХранилище);
	
	Если АдресТаблицаБазисныеЗначенияВХранилище <> Неопределено Тогда  
		
		Таблица = ПолучитьИзВременногоХранилища(АдресТаблицаБазисныеЗначенияВХранилище);	
		
		Для Каждого СтрокаТаблицы Из Таблица Цикл
			
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ВидКультуры                  = СтрокаТаблицы.ВидКультуры;
			НоваяСтрока.Влажность                    = СтрокаТаблицы.Влажность;
			НоваяСтрока.ВлажностьДляРасчетаУслуг     = СтрокаТаблицы.ВлажностьДляРасчетаУслуг;
			НоваяСтрока.СорнаяПримесь                = СтрокаТаблицы.СорнаяПримесь;
			НоваяСтрока.СорнаяПримесьДляРасчетаУслуг = СтрокаТаблицы.СорнаяПримесьДляРасчетаУслуг;
			НоваяСтрока.ЗерноваяПримесь              = СтрокаТаблицы.ЗерноваяПримесь;
								
		КонецЦикла;
		
	КонецЕсли;
		       		
КонецПроцедуры 

#КонецОбласти

#КонецЕсли
